backFacingStep/0/k
FoamFile
{
    version 2.0;
    format  ascii;
    class   volScalarField;
    object  k;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type fixedValue;
        value uniform 0;
    }
    outlet
    {
        type zeroGradient;
    }
    walls
    {
        type fixedValue;
        value uniform 0;
    }
    frontAndBack
    {
        type empty;
    }
}