backFacingStep/0/nut
FoamFile
{
    version 2.0;
    format  ascii;
    class   volScalarField;
    object  nut;
}

dimensions [0 2 -1 0 0 0 0];

internalField uniform 0;

boundaryField
{
    inlet
    {
        type fixedValue;
        value uniform 0;
    }
    outlet
    {
        type zeroGradient;
    }
    walls
    {
        type fixedValue;
        value uniform 0;
    }
    frontAndBack
    {
        type empty;
    }
}