backFacingStep/system/blockMeshDict
FoamFile
{
    version 2.0;
    format  ascii;
    class   dictionary;
    object  blockMeshDict;
}

scale 1;

vertices
(
    (1  0  0  )
    (20 0  0  )
    (0  1  0  )
    (1  1  0  )
    (20 1  0  )
    (0  2  0  )
    (1  2  0  )
    (20 2  0  )
    (1  0  0.1)
    (20 0  0.1)
    (0  1  0.1)
    (1  1  0.1)
    (20 1  0.1)
    (0  2  0.1)
    (1  2  0.1)
    (20 2  0.1)
);

blocks
(
    hex (0  1  4  3  8  9  12 11) (760 40 1) simpleGrading (1 1 1)
    hex (2  3  6  5  10 11 14 13) (40  40 1) simpleGrading (1 1 1)
    hex (3  4  7  6  11 12 15 14) (760 40 1) simpleGrading (1 1 1)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (2  5  13 10)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (12 15 7  4 )
            (9  12 4  1 )
        );
    }
    walls
    {
        type wall;
        faces
        (
            (1  0  8  9 )
            (5  6  14 13)
            (6  7  15 14)
            (3  2  10 11)
            (0  3  11 8 )
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (10 13 14 11)
            (11 14 15 12)
            (8  11 12 9 )
            (3  6  5  2 )
            (4  7  6  3 )
            (1  4  3  0 )
        );
    }
);