backFacingStep/system/controlDict
FoamFile
{
    version 2.0;
    format  ascii;
    class   dictionary;
    object  controlDict;
}

application pisoFoam;

startFrom startTime;

startTime 0;

stopAt endTime;

endTime 100;

deltaT 1e-2;

writeControl timeStep;

writeInterval 50;

purgeWrite 0;

writeFormat ascii;

writePrecision 6;

writeCompression off;

timeFormat general;

timePrecision 6;

runTimeModifiable true;

functions
{
    fieldAverage1
    {
        type            fieldAverage;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;

        fields
        (
            U
            {
                mean        on;
                prime2Mean  off;
                base        time;
            }

            p
            {
                mean        on;
                prime2Mean  off;
                base        time;
            }
        );
    }
}