backFacingStep/system/fvSchemes
FoamFile
{
    version 2.0;
    format  ascii;
    class   dictionary;
    object  fvSchemes;
}

ddtSchemes
{
    default backward;
}

gradSchemes
{
    default Gauss linear;
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss LUST grad(U);
    div(phi,k)      Gauss limitedLinear 1;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default Gauss linear orthogonal;
}

interpolationSchemes
{
    default linear;
}

snGradSchemes
{
    default orthogonal;
}